app/controllers/locations_controller.rb

  def index
    if params[:search].present?
      @locations = Location.near(params[:search], 20)
    else
      @locations = Location.all
---
SELECT locations.*, (69.09332411348201 * ABS(locations.latitude - 28.5532118) * 0.7071067811865475) + (59.836573914187355 * ABS(locations.longitude - 77.1744823) * 0.7071067811865475) AS distance, CASE WHEN (locations.latitude >= 28.5532118 AND locations.longitude >= 77.1744823) THEN  45.0 WHEN (locations.latitude <  28.5532118 AND locations.longitude >= 77.1744823) THEN 135.0 WHEN (locations.latitude <  28.5532118 AND locations.longitude <  77.1744823) THEN 225.0 WHEN (locations.latitude >= 28.5532118 AND locations.longitude <  77.1744823) THEN 315.0 END AS bearing FROM "locations"  WHERE (locations.latitude BETWEEN 28.480845908444575 AND 28.625577691555424 AND locations.longitude BETWEEN 77.09209606630269 AND 77.2568685336973)  ORDER BY distance ASC

  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("address", "created_at", "latitude", "longitude", "message", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["address", "New Delhi"], ["created_at", "2014-11-06 04:31:26.695492"], ["latitude", 28.635308], ["longitude", 77.22496], ["message", "Hello"], ["updated_at", "2014-11-06 04:31:26.695492"]]

  def update
    respond_to do |format|
      if @location.update(location_params)
---
UPDATE "locations" SET "address" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "locations"."id" = 2  [["address", "Sector 12, R. K. Puram, Delhi"], ["latitude", 28.5743032], ["longitude", 77.17655479999999], ["updated_at", "2014-11-06 05:24:06.972912"]]